tutorials/incompressibleVoF/rotatingCube/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mover
{
    type            motionSolver;

    libs            ("libfvMotionSolvers.so");

    motionSolver    solidBody;

    cellZone        rotating;

    solidBodyMotionFunction  rotatingMotion;

    origin          (0 0 0);
    axis            (0 0 1);

    rpm             -60;
}

topoChanger
{
    type            refiner;

    libs            ("libfvMeshTopoChangers.so");

    cellZone        stationary;

    refineInterval  40;

    field           alpha.water;

    lowerRefineLevel 0.001;
    upperRefineLevel 0.999;

    nBufferLayers   1;

    maxRefinement   1;

    maxCells        1000000;

    dumpLevel       true;
}

distributor
{
    type            distributor;

    libs            ("libfvMeshDistributors.so");

    redistributionInterval  100;
}

// ************************************************************************* //
